app/Services/ClasesService.php

SELECT `csc`.`id`, `csc`.`user_id`, `u`.`name`, `u`.`email`
FROM `class_session_coaches` `csc`
JOIN `users` `u` ON `u`.`id` = `csc`.`user_id`
WHERE `csc`.`session_id` = 1
ORDER BY `u`.`name`
---
    public function getCoachesForSession(int $sessionId): array
    {
        return $this->db->table('class_session_coaches csc')
            ->select('csc.id, csc.user_id, u.name, u.email')
            ->join('users u', 'u.id = csc.user_id')
            ->where('csc.session_id', $sessionId)
            ->orderBy('u.name')
            ->get()->getResultArray();

SELECT `csp`.*, `u`.`name`, `u`.`email`, `coach`.`name` AS `coach_name`
FROM `class_session_players` `csp`
JOIN `users` `u` ON `u`.`id` = `csp`.`user_id`
LEFT JOIN `users` `coach` ON `coach`.`id` = `csp`.`coach_id`
WHERE `csp`.`session_id` = 1
ORDER BY `u`.`name`
---
    public function getPlayersForSession(int $sessionId): array
    {
        return $this->db->table('class_session_players csp')
            ->select('csp.*, u.name, u.email, coach.name AS coach_name')
            ->join('users u', 'u.id = csp.user_id')
            ->join('users coach', 'coach.id = csp.coach_id', 'left')
            ->where('csp.session_id', $sessionId)
            ->orderBy('u.name')
            ->get()->getResultArray();

SELECT `id`, `name`, `email`
FROM `users`
WHERE `role` IN ('coach','admin','superadmin')
AND `status` = 'active'
ORDER BY `name`
---
    public function getCoachOptions(): array
    {
        return $this->db->table('users')
            ->select('id, name, email')
            ->whereIn('role', ['coach', 'admin', 'superadmin'])
            ->where('status', 'active')
            ->orderBy('name')
            ->get()->getResultArray();

SELECT `id`, `name`, `email`
FROM `users`
WHERE `role` IN ('alumno','player')
AND `status` = 'active'
ORDER BY `name`
---
    public function getPlayerOptions(): array
    {
        return $this->db->table('users')
            ->select('id, name, email')
            ->whereIn('role', ['alumno', 'player'])
            ->where('status', 'active')
            ->orderBy('name')
            ->get()->getResultArray();

SELECT `id`, `name`, `type`, `address`
FROM `locations`
WHERE `active` = 1
ORDER BY `name`
---
    public function getLocationOptions(): array
    {
        return $this->db->table('locations')
            ->select('id, name, type, address')
            ->where('active', 1)
            ->orderBy('name')
            ->get()->getResultArray();

DELETE FROM `class_session_coaches`
WHERE `session_id` = 1
---
    private function syncCoaches(int $sessionId, array $userIds): void
    {
        $this->db->table('class_session_coaches')->where('session_id', $sessionId)->delete();

DELETE FROM `class_session_players`
WHERE `session_id` = 1
---
    private function syncPlayers(int $sessionId, array $userIds, array $coachMap): void
    {
        $this->db->table('class_session_players')->where('session_id', $sessionId)->delete();