app/Services/ClasesService.php

                foreach ($sessionPlayers as $pid) {
                    $status = $coverage[$pid]['allocation'][$date]['status'] ?? null;
                    if ($status !== null) {
                        $this->db->table('class_session_players')
                            ->where('session_id', $sid)->where('user_id', $pid)
                            ->update(['bono_coverage' => $status]);
---
SELECT *
FROM `class_session_players`
WHERE `session_id` = 1
AND `user_id` = 5
 LIMIT 1