app/Services/ConfiguracionService.php

    public function getStaffUsers(): array
    {
        return $this->users
            ->whereIn('role', ['admin', 'staff', 'coach'])
            ->orderBy('role',  'ASC')
            ->orderBy('name',  'ASC')
            ->findAll();
---
SELECT *
FROM `users`
WHERE `role` IN ('admin','staff','coach')
ORDER BY `role` ASC, `name` ASC

    public function updateStaffRole(int $userId, string $newRole, int $byUserId): bool
    {
        if ($userId <= 0 || $byUserId <= 0)    return false;
        $allowed = ['admin', 'staff', 'coach'];
        if (!in_array($newRole, $allowed))     return false;
        if ($userId === $byUserId)             return false;

        $user = $this->users->find($userId);
        if (!$user || $user['role'] === 'superadmin') return false;

        // Query builder directo para evitar callbacks/validaciones del Model
        // que podrían interferir cuando solo se actualiza un campo.
        return (bool) \Config\Database::connect()
            ->table('users')
            ->where('id', $userId)
            ->update(['role' => $newRole]);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 7
UPDATE `users` SET `role` = 'staff', `updated_at` = '2026-04-11 19:40:03'
WHERE `users`.`id` IN (7)