app/Models/ClassSessionModel.php

SELECT *
FROM `class_sessions`
WHERE `session_date` >= '2026-04-01'
AND `session_date` <= '2026-04-30'
AND `status` != 'cancelled'
ORDER BY `session_date` ASC, `start_time` ASC
---
    public function getForMonth(int $year, int $month): array
    {
        $start = sprintf('%04d-%02d-01', $year, $month);
        $end   = date('Y-m-t', strtotime($start));

        return $this->where('session_date >=', $start)
                    ->where('session_date <=', $end)
                    ->where('status !=', 'cancelled')
                    ->orderBy('session_date', 'ASC')
                    ->orderBy('start_time', 'ASC')
                    ->findAll();