app/Models/UserModel.php

    public function countByRole(string $role): int
    {
        return $this->where('role', $role)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'player'